#### BalusterPlacement Members

---

|  |
| --- |
| BalusterPlacement Class   Methods   Properties   See Also |

The  BalusterPlacement  type exposes the following members.

# Methods

|  | Name | Description |
| --- | --- | --- |
| Public method | Dispose | Releases all resources used by the  BalusterPlacement |
| Public method | Equals | Determines whether the specified  Object  is equal to the current  Object  . (Inherited from  Object  .) |
| Public method | GetHashCode | Serves as a hash function for a particular type. (Inherited from  Object  .) |
| Public method | GetType | Gets the  Type  of the current instance. (Inherited from  Object  .) |
| Public method | ToString | Returns a string that represents the current object. (Inherited from  Object  .) |

# Properties

|  | Name | Description |
| --- | --- | --- |
| Public property | BalusterPattern | Accesses the object containing properties related to the baluster pattern. |
| Public property | BalusterPerTreadFamilyId | The id of baluster per tread family. |
| Public property | BalusterPerTreadNumber | The number of balusters per tread. |
| Public property | IsValidObject | Specifies whether the .NET object represents a valid Revit entity. |
| Public property | PostPattern | Accesses the object containing properties related to the post pattern. |
| Public property | UseBalusterPerTreadOnStairs | If true, one or more balusters will be included on each tread of an associated stair. If false, this is not guaranteed to happen. |

# See Also

BalusterPlacement Class

Autodesk.Revit.DB.Architecture Namespace